package _3_test_260115.homework;

public class _0_Test_homework_Ex2 {
    public static void main(String[] args) {
//        2. (2차원 배열 & 조건문)
        System.out.println("숙제 실습2 : 2차원 배열 & 조건문 ");
//        1) 4x4 크기의 2차원 정수 배열을 만드세요.
        int[][] matrix = new int[4][4];
//        이중 반복문을 사용하여 행의 인덱스와 열의 인덱스가 같을 때(i == j)는
//        1을 저장하고, 다를 때는 0을 저장하세요.
//        matrix[i][j] = 1;
        // i = 0, j = 0,1,2,3
//        matrix[0][0] = 1;
//        matrix[0][1] = 0;
//        matrix[0][2] = 0;
//        matrix[0][3] = 0;
//        : (생략)
        // i = 1, j = 0,1,2,3
//        matrix[1][1] = 1;
//        :(생략)
        // i = 2, j = 0,1,2,3
//        matrix[2][2] = 1;
//        :(생략)
        // i = 3, j = 0,1,2,3
//        matrix[3][0] = 0;
//        matrix[3][1] = 0;
//        matrix[3][2] = 0;
//        matrix[3][3] = 1;
//        총 16번 해야함. -> 비효율적, for를 이용하자.
        for (int i = 0; i < 4; i++) {
            for (int j = 0; j < 4; j++) {
                if (i == j) {
//                    matrix[0][0] = 1;
//                    matrix[1][1] = 1;
//                    matrix[2][2] = 1;
//                    matrix[4][3] = 1;
                    matrix[i][j] = 1;
                } else {
                    matrix[i][j] = 0;
                } // else 닫기
            } // 안 for 닫기
        }// 밖 for 닫기
        // 배열에 값이 채워져 있나요? 네

//        2) 그 후 배열의 형태를 출력하세요. (대각선 줄 긋기)
        // 출력 전략, 하나의 행을 가로로 다 출력후,
        // 줄 넘김.
        // 다음 줄 , 출력.
        // 기본 for 대신에, 향상된 for 문 (범위를 지정 안해도, 자동으로 전체의 모든 요소를 순회(반복)함.)
        // for([한개의 요소를 담을 타입 및 변수명] : [배열])
        // matrix : 이중 배열, 배열안에 배열 들어간 형태.
        // matrix = { // 배열안의 요소는 배열입니다.
        // {1,0,0,0},
        // {0,1,0,0},
        // {0,0,1,0},
        // {0,0,0,1}
        // }
        // 여기서도, 배열안의 요소가 배열이므로, 한개 꺼내서 받을 때에도, 배열로 받아야함.
        for(int[] row : matrix) {
            // 1) row : {1,0,0,0}
            // 2) row : {0,1,0,0},
            // 3) row : {0,0,1,0},
            // 4) row : {0,0,0,1}
            // 이번에는 row 라는 배열에서, 각 요소를 하나씩 꺼내기.
            for (int val :row){
                // 1) val -> 1, 0, 0, 0
                // 2) val -> 0, 1, 0, 0
                // 3) val -> 0, 0, 1, 0
                // 4) val -> 0, 0, 0, 1
                // 출력은 줄 넘김 없이, 옆에 출력하는 print  함수를 이용하기.
                System.out.print(val + " ");
            }// 안 for 닫기 // 각 행씩 출력하고,
            // 각 행 다음 줄로 넘어가기.
            System.out.println();// 줄넘김.
        } // 밖 for 닫기

//        힌트) 출력 print()
//                - 줄바꿈을 할 때 : System.out.println();
    }
}
